nguyenkhacnhathuy480-ctrl/BaiTap_HTN/BaiTap_HTN_W2/Common/Inc/stm32f1xx_hal_conf.h
#ifndef STM32F1XX_HAL_CONF_H
#define STM32F1XX_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

#define HAL_MODULE_ENABLED
#define HAL_ADC_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_TIM_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED

#ifndef HSE_VALUE
#define HSE_VALUE              8000000U
#endif
#define HSE_STARTUP_TIMEOUT    100U
#define HSI_VALUE              8000000U
#define LSI_VALUE              40000U
#define LSE_VALUE              32768U
#define LSE_STARTUP_TIMEOUT    5000U

#define VDD_VALUE              3300U
#define TICK_INT_PRIORITY      0x0FU
#define USE_RTOS               0U
#define PREFETCH_ENABLE        1U

#define USE_HAL_ADC_REGISTER_CALLBACKS   0U
#define USE_HAL_DMA_REGISTER_CALLBACKS   0U
#define USE_HAL_TIM_REGISTER_CALLBACKS   0U
#define USE_HAL_UART_REGISTER_CALLBACKS  0U

#define assert_param(expr) ((void)0U)

#include "stm32f1xx_hal_rcc.h"
#include "stm32f1xx_hal_gpio.h"
#include "stm32f1xx_hal_dma.h"
#include "stm32f1xx_hal_cortex.h"
#include "stm32f1xx_hal_adc.h"
#include "stm32f1xx_hal_flash.h"
#include "stm32f1xx_hal_pwr.h"
#include "stm32f1xx_hal_tim.h"
#include "stm32f1xx_hal_uart.h"

#ifdef __cplusplus
}
#endif

#endif
